ezois_ka/oooezoiskaobmen/src/Documents/ЗаказНаЭмиссиюКодовМаркировкиСУЗ/ЗаказНаЭмиссиюКодовМаркировкиСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказНаЭмиссиюКодовМаркировкиСУЗ</name>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ОснованиеЗаказНаЭмиссиюКодовМаркировкиИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПродукции</name>
    <type>
      <types>EnumRef.ВидыПродукцииИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПроизводственногоЗаказа</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПроизводственнойЛинии</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныйОбъект</name>
    <type>
      <types>DefinedType.ПроизводственныйОбъектИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныйОбъектИдентификатор</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныйОбъектАдрес</name>
    <comment>Внутренние значения полей адреса доставки (контактная информация)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныйОбъектАдресСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособВводаВОборот</name>
    <type>
      <types>EnumRef.СпособыВводаВОборотСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемаяДатаНачалаПроизводства</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>DefinedType.ПользователиИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>DefinedType.КонтрагентГосИС</types>
    </type>
  </attributes>
  <attributes>
    <name>БезУчетаНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВвезенПослеДатыОбязательнойМаркировки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриобретенПроизведенПослеДатыОбязательнойМаркировки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СервисПровайдер</name>
    <type>
      <types>CatalogRef.СервисПровайдерыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЗаявки</name>
    <type>
      <types>DefinedType.ИдентификаторЗаявкиИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплатыКодовМаркировки</name>
    <type>
      <types>EnumRef.ТипыОплатыКодовМаркировкиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДоговораСОператором</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоговораСОператором</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВидСредстваИдентификации</name>
    <type>
      <types>EnumRef.ВидыСредствИдентификацииСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВидМаркировки</name>
    <type>
      <types>EnumRef.ВидыМаркировкиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>GLNОрганизации</name>
    <type>
      <types>DefinedType.GLN</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПолучения</name>
    <type>
      <types>EnumRef.СпособыПолученияИзготовленныхКИЗГИСМ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СерийныеНомера</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>DefinedType.УникальныйИдентификаторИС</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>DefinedType.УникальныйИдентификаторИС</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.ХарактеристикаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>DefinedType.Упаковка</types>
      </type>
    </attributes>
    <attributes>
      <name>GTIN</name>
      <type>
        <types>DefinedType.GTIN</types>
      </type>
    </attributes>
    <attributes>
      <name>Код</name>
      <comment>Код товара в ИС МП</comment>
      <type>
        <types>DefinedType.УникальныйИдентификаторИС</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Шаблон</name>
      <type>
        <types>EnumRef.ШаблоныКодовМаркировкиСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>МаксимальнаяРозничнаяЦена</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаГосИСНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособФормированияСерийногоНомера</name>
      <type>
        <types>EnumRef.СпособыФормированияСерийногоНомераСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодТНВЭД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦелевойПол</name>
      <type>
        <types>EnumRef.ЦелевойПолИСМП</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособВводаВОборот</name>
      <type>
        <types>EnumRef.СпособыВводаВОборотСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>Модель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТоварныйЗнак</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВозрастнаяКатегория</name>
      <type>
        <types>EnumRef.ВозрастныеКатегорииИСМП</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокГодности</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьШаблонЭтикетки</name>
      <type>
        <types>CatalogRef.УдалитьШаблоныЭтикетокСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидКИЗ</name>
      <type>
        <types>EnumRef.ВидыКиЗГИСМ</types>
      </type>
    </attributes>
    <attributes>
      <name>РазмерКИЗ</name>
      <type>
        <types>EnumRef.РазмерыКиЗГИСМ</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрокиВладельца</name>
      <type>
        <types>DefinedType.УникальныйИдентификаторИС</types>
      </type>
    </attributes>
    <attributes>
      <name>ВладелецGTIN</name>
      <type>
        <types>DefinedType.ОрганизацияКонтрагентГосИС</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen/src/CommonModules/ИнтеграцияИСМПВызовСервера/Module.bsl
#Область ПрограммныйИнтерфейс

#Область ДлительныеОперации

// Подготавливает сообщения к передаче в сервис ИСМП.
//
// Параметры:
//  ПараметрыЗагрузки - Структура - Структура со свойствами:
//   * Организация - ОпределяемыйТип.Организация - Организация
//   * Интервал - Структура - Структура со свойствами:
//     ** НачалоПериода - Дата - Дата начала периода.
//     ** КонецПериода - Дата - Дата окончания периода.
//  УникальныйИдентификатор - УникальныйИдентификатор - Уникальный идентификатор формы.
// 
// Возвращаемое значение:
//  Структура - см. функцию ПодготовитьСообщенияКПередаче().
//
Функция ЗагрузитьВходящиеДокументы(ПараметрыЗагрузки, УникальныйИдентификатор = Неопределено) Экспорт
	
	ПараметрыОбмена = ОбменДаннымиИСМП.ПараметрыОбмена(ПараметрыЗагрузки.Организация, УникальныйИдентификатор);
	
	Если УникальныйИдентификатор <> Неопределено И Не ОбщегоНазначенияИС.РежимРаботыБезФоновыхЗаданий() Тогда
		
		ВозвращаемоеЗначение = Новый Структура;
		ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии", Неопределено);
		ВозвращаемоеЗначение.Вставить("ДоступныеСертификаты",           Неопределено);
		ВозвращаемоеЗначение.Вставить("ТребуетсяПодписание",            Неопределено);
		ВозвращаемоеЗначение.Вставить("КОпределениюВидаУпаковки",       Неопределено);
		ВозвращаемоеЗначение.Вставить("Изменения",                      Новый Массив);
		ВозвращаемоеЗначение.Вставить("ДлительнаяОперация",             Неопределено);
		ВозвращаемоеЗначение.Вставить("Ожидать",                        Неопределено);
		ВозвращаемоеЗначение.Вставить("АдресВоВременномХранилище",      Неопределено);
		
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
		ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Загрузка входящих документов из ИС МП'");
		
		ПараметрыФоновогоЗадания = Новый Структура;
		ПараметрыФоновогоЗадания.Вставить("ПараметрыЗагрузки", ПараметрыЗагрузки);
		ПараметрыФоновогоЗадания.Вставить("ПараметрыОбмена",   ПараметрыОбмена);
		ПараметрыФоновогоЗадания.Вставить("ПараметрыСеансаИС", ОбменДаннымиИСМП.ПараметрыСеансаИС());
		
		ИнтеграцияИСПереопределяемый.НастроитьДлительнуюОперацию(ПараметрыФоновогоЗадания, ПараметрыВыполнения);
		
		ВозвращаемоеЗначение.ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне(
			"ИнтеграцияИСМПСлужебный.ЗагрузитьВходящиеДокументыДлительнаяОперация",
			ПараметрыФоновогоЗадания, ПараметрыВыполнения);
		
	Иначе
		
		ВозвращаемоеЗначение = ИнтеграцияИСМПСлужебный.ЗагрузитьВходящиеДокументыУниверсально(ПараметрыЗагрузки, ПараметрыОбмена);
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Запуск в фоне заполнения настроек разрешительного режима - аналогично обработчику обновления, но при включении новой товарной группы, 
// если на момент обновления таковых не велось
// 
// Параметры:
//  УникальныйИдентификатор - УникальныйИдентификатор, Неопределено - Уникальный идентификатор формы
// 
// Возвращаемое значение:
//  см. ДлительныеОперации.ВыполнитьВФоне.
Функция ЗапуститьЗаполнениеНастроекРазрешительногоРежима(УникальныйИдентификатор = Неопределено) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Первичная настройка разрешительного режима'");
	
	ПараметрыФоновогоЗадания = Новый Структура;
	ПараметрыФоновогоЗадания.Вставить("ПараметрыЛогированияЗапросовИСМП", ПараметрыСеанса.ПараметрыЛогированияЗапросовИСМП);
	
	Если ОбщегоНазначенияИСМП.ЭтоРасширеннаяВерсияГосИС() Тогда
		МодульИнтеграцияИСПереопределяемый = ОбщегоНазначения.ОбщийМодуль("ИнтеграцияИСПереопределяемый");
		МодульИнтеграцияИСПереопределяемый.НастроитьДлительнуюОперацию(ПараметрыФоновогоЗадания, ПараметрыВыполнения);
	КонецЕсли;
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне(
		"ИнтеграцияИСМП.ВыполнитьОбновлениеНастроекДляРазрешительногоРежимаДлительнаяОперация",
		ПараметрыФоновогоЗадания, ПараметрыВыполнения);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область НастройкиУчета

// Возвращает дату обязательной маркировки маркируемой продукци переданного вида.
// 
// Параметры:
//  ВидМаркируемойПродукции - ПеречислениеСсылка.ВидыПродукцииИС - вид маркируемой продукции
// Возвращаемое значение:
// 	Дата - дата обязательной маркировки маркируемой продукции.
//
Функция ДатаОбязательнойМаркировкиПродукции(ВидМаркируемойПродукции) Экспорт
	
	ДатаОбязательнойМаркировки = '00010101';
	
	ТекстЗапроса = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДатаКонтрольПроизводства КАК ДатаКонтрольПроизводства
	|ИЗ
	|	РегистрСведений.НастройкиУчетаМаркируемойПродукцииИСМП
	|ГДЕ
	|	ВидПродукции = &ВидМаркируемойПродукции
	|";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ВидМаркируемойПродукции", ВидМаркируемойПродукции);
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ДатаОбязательнойМаркировки = Выборка.ДатаКонтрольПроизводства;
	КонецЕсли;
	
	Возврат ДатаОбязательнойМаркировки;

КонецФункции

// Возвращает виды продукции, по которым доступно заполнение документа ИСМП
//
// Параметры:
//   ПолноеИмяДокумента - Строка - создаваемый вводом на основании документ
//   Ссылка - ОпределяемыйТип.ОснованиеСтатусыОформленияДокументовИСМП - документ по которому происходит обработка заполнения
//
// Возвращаемое значение:
//   Массив Из ПеречислениеСсылка.ВидыПродукцииИС - различные виды продукции в документе ИСМП, заполненном 
//     по основанию без фильтра по виду продукции.
Функция ВидыПродукцииДанныхЗаполнения(ПолноеИмяДокумента, Ссылка) Экспорт
	
	ДоступныеВидыПродукции = Новый Массив;
	
	Если НЕ ИнтеграцияИСМПКлиентСерверПовтИсп.ВестиУчетМаркируемойПродукции() Тогда
		Возврат ДоступныеВидыПродукции;
	КонецЕсли;
	
	ВидыПродукцииИСМП = ОбщегоНазначенияИСКлиентСервер.ВидыПродукцииИСМП(Истина);
	Для Каждого ВидПродукцииИСМП Из ВидыПродукцииИСМП Цикл
		Если ИнтеграцияИСМПКлиентСерверПовтИсп.ВестиУчетМаркируемойПродукции(ВидПродукцииИСМП) Тогда
			ДоступныеВидыПродукции.Добавить(ВидПродукцииИСМП);
		КонецЕсли;
	КонецЦикла;
	
	Если ДоступныеВидыПродукции.Количество() < 2 Тогда
		Возврат ДоступныеВидыПродукции;
	КонецЕсли;
	
	ИмяДокумента = СтрРазделить(ПолноеИмяДокумента, ".")[1];
	Предзаполнение = Документы[ИмяДокумента].СоздатьДокумент();
	Если Предзаполнение.Метаданные().ТабличныеЧасти.Найти("Товары") = Неопределено Тогда
		Возврат ДоступныеВидыПродукции;
	КонецЕсли;
	
	Предзаполнение.Заполнить(Ссылка);
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.МаркировкаТоваровИСМП")
		И ИнтеграцияИС.ЕстьРеквизитТабЧастиОбъекта("GTIN", Предзаполнение.Метаданные(), "Товары")
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Операция") = Перечисления.ВидыОперацийИСМП.ВводВОборотМаркировкаОстатков Тогда
		Товары = Предзаполнение.Товары.Выгрузить(, "Номенклатура, GTIN");
		ПараметрыЗаполненияПоКодамОстатков = Новый Структура;
		ПараметрыЗаполненияПоКодамОстатков.Вставить("Организация", Предзаполнение.Организация);
	Иначе
		Товары = Предзаполнение.Товары.Выгрузить(, "Номенклатура");
		Товары.Колонки.Добавить("GTIN", Метаданные.ОпределяемыеТипы.GTIN.Тип);
		ПараметрыЗаполненияПоКодамОстатков = Неопределено;
	КонецЕсли;
	
	Товары.Колонки.Добавить("Характеристика", Метаданные.ОпределяемыеТипы.ХарактеристикаНоменклатуры.Тип);
	
	Возврат ИнтеграцияИСМП.ВидыПродукцииПоТаблицеНоменклатуры(Товары, ПараметрыЗаполненияПоКодамОстатков);
	
КонецФункции

// 
// Параметры:
// 	Номенклатура - ОпределяемыйТип.Номенклатура - Номенклатура
// Возвращаемое значение:
// 	СправочникСсылка.ВидыАлкогольнойПродукции
//
Функция ВидПродукцииПоНоменклатуре(Номенклатура) Экспорт
	Возврат ОбщегоНазначенияИС.ВидПродукцииПоНоменклатуре(Номенклатура);
КонецФункции

// Возвращает признак необходимости контроля статусов кодов маркировок ИС МП.
//
//Параметры:
//	 ВидПродукции - ПеречислениеСсылка.ВидыПродукцииИС - Вид продукции
//	 ВидОперации  - ПеречислениеСсылка.ВидыОперацийИСМП, Неопределено - Вид операции.
//	
// Возвращаемое значение:
//  Произвольный - Истина, в случае необходимости контроля статусов.
Функция КонтролироватьСтатусыКодовМаркировки(ВидПродукции = Неопределено, ВидОперации = Неопределено) Экспорт
	
	Возврат ОбщегоНазначенияИСМПКлиентСерверПовтИсп.КонтролироватьСтатусыКодовМаркировки(ВидПродукции = Неопределено, ВидОперации = Неопределено);
	
КонецФункции

// Возвращает признак необходимости контроля статусов кодов маркировок при розничной торговле.
//
//Параметры:
//	 ВидПродукции - ПеречислениеСсылка.ВидыПродукцииИС - Вид продукции
//	 ВидОперации  - ПеречислениеСсылка.ВидыОперацийИСМП, Неопределено - Вид операции.
// Возвращаемое значение:
//  Булево - Истина, в случае необходимости контроля статусов в рознице.
Функция КонтролироватьСтатусыКодовМаркировкиВРознице(ВидПродукции = Неопределено, ВидОперации = Неопределено) Экспорт
	
	Возврат ОбщегоНазначенияИСМПКлиентСерверПовтИсп.КонтролироватьСтатусыКодовМаркировкиВРознице(ВидПродукции = Неопределено, ВидОперации = Неопределено);
	
КонецФункции

// Возвращает список учитываемых товарных групп перемещения между МОД на конкретную дату.
// 
// Параметры:
//  НаДату - Дата - дата проверки
// 
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.ВидыПродукцииИС
Функция СписокУчитываемойПродукцииКонтроляПеремещенийМеждуМОД(НаДату = Неопределено) Экспорт
	
	Возврат РегистрыСведений.НастройкиУчетаМаркируемойПродукцииИСМП.СписокУчитываемойПродукцииПоддерживающейПеремещениеМеждуМОД(НаДату);
	
КонецФункции

#КонецОбласти

// Функция - Документы ИСМП по документу основанию
//
// Параметры:
//  ДокументОснование - ДокументСсылка - основание по которому надо получить документы ИСМП
// 
// Возвращаемое значение:
//  см. ИнтеграцияИС.ДокументыИСПоДокументуОснованию
//
Функция ДокументыИСМППоДокументуОснованию(ДокументОснование) Экспорт
	
	ДокументыИСМП = ИнтеграцияИС.ДокументыИСПоДокументуОснованию(
		ДокументОснование,
		Метаданные.РегистрыСведений.СтатусыДокументовИСМП);
	
	Возврат ДокументыИСМП;
	
КонецФункции

// Возвращает имена документов ИСМП, основанием для которых может являться указанный документ.
//
// Параметры:
//   ДокументОснование - ОпределяемыйТип.ОснованиеСтатусыОформленияДокументовИСМП - документ-основание для документа ИСМП
//
// Возвращаемое значение:
//   Массив из Строка - имена документов ИСМП
//
Функция ИменаДокументовДляДокументаОснования(ДокументОснование) Экспорт
	
	Возврат РасчетСтатусовОформленияИСМП.ИменаДокументовДляДокументаОснования(ДокументОснование);
	
КонецФункции

// см. РегистрыСведений.СтатусыОформленияДокументовИСМП.АрхивироватьРаспоряженияКОформлению
Функция АрхивироватьРаспоряженияКОформлению(Основания, Документ) Экспорт
	
	Возврат РегистрыСведений.СтатусыОформленияДокументовИСМП.АрхивироватьРаспоряженияКОформлению(Основания, Документ);
	
КонецФункции

Функция ТекстНадписиПоляИнтеграцииВФормеДокументаОснования(Знач ДокументОснование) Экспорт
	
	ТекстНадписи = "";
	
	// Получим структуру вида ИмяДокументаИСМП - Статус
	СтатусыОформления = РегистрыСведений.СтатусыОформленияДокументовИСМП.СтатусыДокументовИСМППоДокументуОснованию(ДокументОснование);
	
	Если НЕ ЗначениеЗаполнено(СтатусыОформления) Тогда
		Возврат ТекстНадписи;
	КонецЕсли;
	
	// Получим структуру вида ИмяДокументаИСМП - Массив(ДокументыИСМПДанногоВида)
	ДокументыИСМП = ДокументыИСМППоДокументуОснованию(ДокументОснование);
	
	ТекстыНадписиПоДокументам = Новый Массив;
	
	Для Каждого КлючИЗначение Из СтатусыОформления Цикл
		
		МетаданныеДокумента = Метаданные.Документы[КлючИЗначение.Ключ];
		
		Если ИнтеграцияИС.РеквизитДокументОснованиеДокументаИС(МетаданныеДокумента).Тип.СодержитТип(ТипЗнч(ДокументОснование)) Тогда
			
			// Получим структуру с ключами "Представление, МассивДокументов, СтатусОформления, МетаданныеДокумента"
			Описание = ИнтеграцияИСМП.ОписаниеОформленныхДокументов(МетаданныеДокумента, ДокументОснование, ДокументыИСМП, СтатусыОформления);
			
			Если Описание = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если ТекстыНадписиПоДокументам.Количество() > 0 Тогда
				ТекстыНадписиПоДокументам.Добавить(", ");
			КонецЕсли;
			
			ТекстыНадписиПоДокументам.Добавить(Описание.ТекстНадписи);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТекстНадписи = Новый ФорматированнаяСтрока(ТекстыНадписиПоДокументам);
	Возврат ТекстНадписи;
	
КонецФункции

// Получает ТН ВЭД
//
// Параметры:
//  КодТНВЭД - Строка - Код по классификатору товарной номенклатуры внешнеэкономической деятельности
//
// Возвращаемое значение:
//   Произвольный - элемент классификатора (если он определен в конфигурации)
//
Функция КлассификаторТНВЭДПоКоду(КодТНВЭД) Экспорт
	
	ТНВЭД = Неопределено;
	
	ИнтеграцияИСМППереопределяемый.КлассификаторТНВЭД(КодТНВЭД, ТНВЭД);
	
	Возврат ТНВЭД;
	
КонецФункции

Функция ИнформацияСертификатовНоменклатуры(СписокНоменклатуры) Экспорт
	
	СертификатыНоменклатуры = Новый Соответствие;
	ИнтеграцияИСПереопределяемый.ПриЗаполненииСертификатовНоменклатуры(СписокНоменклатуры, СертификатыНоменклатуры);
	
	Возврат СертификатыНоменклатуры;
	
КонецФункции

Функция ТребуетсяПерейтиВПул(Знач ДокументОснование) Экспорт
	
	Возврат Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ТребуетсяПерейтиВПул(ДокументОснование);
	
КонецФункции

Функция ОрганизацияЯвляетсяФермером(Организация) Экспорт
	
	КодОКОПФ = "";
	
	ИнтеграцияИСПереопределяемый.КодОКОПФОрганизации(КодОКОПФ, Организация);
	
	Возврат КодОКОПФ = "15300" Или КодОКОПФ = "50101" Или КодОКОПФ = "14100";
	
КонецФункции

Функция ЭлектронныйДокументПоОбъектуУчета(ОбъектыУчета) Экспорт
	
	Результат = Новый Соответствие();
	
	Если ТипЗнч(ОбъектыУчета) = Тип("Массив") Тогда
		Источник = ОбъектыУчета;
	Иначе
		Источник = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ОбъектыУчета);
	КонецЕсли;
	
	Для Каждого ОбъектУчета Из Источник Цикл
		Если ЗначениеЗаполнено(ОбъектУчета) Тогда
			Результат.Вставить(
				ОбъектУчета,
				ОбменСКонтрагентами.СтатусДокументооборота(ОбъектУчета).ЭлектронныйДокумент);
		Иначе
			Результат.Вставить(
				ОбъектУчета,
				Неопределено);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Функция возвращает данные по электронному документу и результатам проверки ГИС МТ
//  для определения возможности формирования разрешения на отгрузку ГИС МТ.
// 
// Параметры:
//  ОбъектыУчета - ДокументСсылка, Массив из ДокументСсылка - ссылки на проверяемые документы.
//  ЭлектронныеДокументы - ДокументСсылка.ЭлектронныйДокументИсходящийЭДО, Массив из ДокументСсылка.ЭлектронныйДокументИсходящийЭДО - массив электронных документов.
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//		* Ключ - ДокументСсылка - ссылка на проверяемый документ
//		* Значение - Структура из КлючИЗначение:
//			** ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументИсходящийЭДО,
//                                   ДокументСсылка.ЭлектронныйДокументВходящийЭДО,
//                                   Неопределено - ссылка на электронный документ. Если в
//                                          параметре "Документ" передан учетный документ, возвращается актуальный
//                                          для него электронный. Если передан электронный - возвращается та же ссылка.
//			** РезультатПроверкиГИСМТ - см. ИнициализироватьРезультатПроверкиЭлектронногоДокументаИСостояния.
//
Функция ДанныеЭлектронногоДокументаИСостоянияПоОбъектуУчета(ОбъектыУчета, ЭлектронныеДокументы = Неопределено) Экспорт
	
	ВозвращаемоеЗначение = Новый Соответствие();
	
	Если ТипЗнч(ОбъектыУчета) = Тип("Массив") Тогда
		Источник = ОбъектыУчета;
	Иначе
		Источник = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ОбъектыУчета);
	КонецЕсли;
	
	МассивИдентификаторовЭД = Новый Массив;
	
	Если ЭлектронныеДокументы <> Неопределено Тогда
		Если ТипЗнч(ЭлектронныеДокументы) = Тип("Массив") Тогда
			
			Для Каждого ЭлектронныйДокумент Из ЭлектронныйДокумент Цикл
				
				СведенияОбЭлектронномДокументе = ОбменСКонтрагентами.СведенияОбЭлектронномДокументе(ЭлектронныйДокумент);
				ИдентификаторЭлектронногоДокумента = СведенияОбЭлектронномДокументе.Сообщения.ДанныеОтправителя.ИмяФайлаБезРасширения;
				
				МассивИдентификаторовЭД.Добавить(ИдентификаторЭлектронногоДокумента);
				
			КонецЦикла;
			
		Иначе
			
			СведенияОбЭлектронномДокументе = ОбменСКонтрагентами.СведенияОбЭлектронномДокументе(ЭлектронныеДокументы);
			ИдентификаторЭлектронногоДокумента = СведенияОбЭлектронномДокументе.Сообщения.ДанныеОтправителя.ИмяФайлаБезРасширения;
			
			МассивИдентификаторовЭД = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ИдентификаторЭлектронногоДокумента);
			
		КонецЕсли;
	КонецЕсли;
	
	СоответствиеИдентификаторовЭДО = СоответствиеТребованиямГИСМТ.СоответствиеСтатусовЭДО(Источник);
	РезультатыОбработкиДокументов  = СоответствиеТребованиямГИСМТ.РезультатПроверкиПоМассивуДокументов(Источник, МассивИдентификаторовЭД);
	
	ПроверкаДоступностиФормированияЭД = ЭлектронноеВзаимодействиеИСМП.ПроверитьДоступностьВыполненияДействийПоЭДО();
	
	Для Каждого ОбъектУчета Из Источник Цикл
		
		РезультатПоДокументу = ИнициализироватьРезультатПроверкиЭлектронногоДокументаИСостояния();
		
		Если Не ЗначениеЗаполнено(ОбъектУчета) Тогда
			ВозвращаемоеЗначение.Вставить(ОбъектУчета, РезультатПоДокументу);
			Продолжить;
		КонецЕсли;
		
		РезультатПоДокументу.ДоступноФормированиеЭД               = ПроверкаДоступностиФормированияЭД.ДоступноФормированиеЭД;
		РезультатПоДокументу.ТекстОшибкиДоступностиФормированияЭД = ПроверкаДоступностиФормированияЭД.ТекстОшибки;
		
		ДанныеЭДО = СоответствиеИдентификаторовЭДО.Получить(ОбъектУчета);
		
		РезультатПоДокументу.ЭлектронныйДокумент = ДанныеЭДО.ЭлектронныйДокумент;
		РезультатПроверкиГИСМТ                   = РезультатыОбработкиДокументов.Получить(ОбъектУчета);
		
		Если Не РезультатПроверкиГИСМТ = Неопределено Тогда
			
			ЗаполнитьЗначенияСвойств(РезультатПоДокументу, РезультатПроверкиГИСМТ);
			РезультатПоДокументу.ТребуетсяОформлениеРазрешенияПоДатеПроизводства = РезультатПроверкиГИСМТ.ТребуетсяПроверкаМОДУчастников;
			
		Иначе
			// если не используется проверка документов на соответствие требованиям ГИС МТ, формировать разрешение без проверки
			РезультатПоДокументу.ТребуетсяОформлениеРазрешенияПоДатеПроизводства = Истина;
		КонецЕсли;
		
		ВозвращаемоеЗначение.Вставить(ОбъектУчета, РезультатПоДокументу);
		
	КонецЦикла;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИнициализироватьРезультатПроверкиЭлектронногоДокументаИСостояния()
	
	СтруктураВозврата = Новый Структура();
	
	СтруктураВозврата.Вставить("ЭлектронныйДокумент",                             Неопределено);
	СтруктураВозврата.Вставить("ВыполненаПредварительнаяПроверка",                Ложь);
	СтруктураВозврата.Вставить("ОтправленНаПредварительнуюПроверку",              Ложь);
	СтруктураВозврата.Вставить("ПроверкаОтключена",                               Ложь);
	СтруктураВозврата.Вставить("Статус",                                          Перечисления.СтатусыОбработкиДокументовИСМП.ПустаяСсылка());
	СтруктураВозврата.Вставить("СтатусДокументаВСервисе",                         Перечисления.СтатусыДокументовИСМП.ПустаяСсылка());
	СтруктураВозврата.Вставить("СтатусОтправки",                                  Перечисления.СтатусОтправкиГИСМТ.ПустаяСсылка());
	СтруктураВозврата.Вставить("ТребуетсяОформлениеРазрешенияПоДатеПроизводства", Ложь);
	СтруктураВозврата.Вставить("ДоступноФормированиеЭД",                          Ложь);
	СтруктураВозврата.Вставить("ТекстОшибкиДоступностиФормированияЭД",            "");
	
	Возврат СтруктураВозврата;
	
КонецФункции

#КонецОбласти
